---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CircuitsOverlapAndDeleteSpareSpace
source: html/632ebbe4-9834-856b-da8a-e5c855afb1ec.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.CircuitsOverlapAndDeleteSpareSpace Property

More than one Spare/Space falls onto the same slot. These Spares/Spaces will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircuitsOverlapAndDeleteSpareSpace { get; }
```